_posts/2013-07-03-linux-kernel.html
---
category: computer science and enginneering
layout: post
title: "General Knowledge of Linux Kernel "
tags: ["linux","linux kernel", Makefile]
---

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">.vmlinux.lds.cmd 怎么来的</h2>
<div class="outline-text-2" id="text-1">
<p>
由下面几个文件中的相关内容可以知道，以2.6.34.13为例
</p>
<div class="org-src-container">

<pre class="src src-sh">scripts/Makefile.build

        317 <span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">Linker scripts preprocessor (.lds.S -&gt; .lds)</span>
        318 <span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">--------------------------------------------------------------------------    -</span>
        319 quiet_cmd_cpp_lds_S = LDS pengcz   $<span style="color: #f0c674;">@</span>
        320     cmd_cpp_lds_S = $(<span style="color: #b294bb;">CPP</span>) $(<span style="color: #b294bb;">cpp_flags</span>) -P -C -U$(<span style="color: #b294bb;">ARCH</span>) <span style="color: #8abeb7;">\</span>
        321                              -D__ASSEMBLY__ -DLINKER_SCRIPT -o $<span style="color: #f0c674;">@</span> $&lt;
        322 
        323 $(<span style="color: #b294bb;">obj</span>)/%.lds: $(<span style="color: #b294bb;">src</span>)/%.lds.S FORCE
        324         $(<span style="color: #b294bb;">call</span> if_changed_dep,cpp_lds_S)
</pre>
</div>
<p>
这里还不能看到会生成*.cmd文件，需要看*if_changed_dep*的定义
</p>
<div class="org-src-container">

<pre class="src src-sh">scripts/Kbuild.include

        214 <span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">Execute the command and also postprocess generated .d dependencies file.</span>
        215 if_changed_dep = $(<span style="color: #b294bb;">if</span> $(<span style="color: #b294bb;">strip</span> $(<span style="color: #b294bb;">any-prereq</span>) $(<span style="color: #b294bb;">arg-check</span>) ),                  <span style="color: #8abeb7;">\</span>
        216         @set -e;                                                             <span style="color: #8abeb7;">\</span>
        217         $(<span style="color: #b294bb;">echo-cmd</span>) $(<span style="color: #b294bb;">cmd_</span>$(<span style="color: #b294bb;">1</span>));                                             <span style="color: #8abeb7;">\</span>
        218         scripts/basic/fixdep $(<span style="color: #b294bb;">depfile</span>) $<span style="color: #f0c674;">@</span> <span style="color: #8abeb7;">'$(</span><span style="color: #b294bb;">make-cmd</span><span style="color: #8abeb7;">)'</span> &gt; $(<span style="color: #b294bb;">dot-target</span>).tmp;<span style="color: #8abeb7;">\</span>
        219         rm -f $(<span style="color: #b294bb;">depfile</span>);                                                    <span style="color: #8abeb7;">\</span>
        220         mv -f $(<span style="color: #b294bb;">dot-target</span>).tmp $(<span style="color: #b294bb;">dot-target</span>).cmd)
</pre>
</div>
<p>
注：(1) 217行的 <b>cmd_$(1)</b> 用户参数替换，因此当执行前面214行的 <b>$(callif_changed_dep,cpp_lds_S)</b> 后，*cmd_$(1)* 变成了 *cmd_cpp_lds_S (2)220行生成.vmlinux.lds.S (3) if_changed_dep是一个公共变量或称为函数，不仅用在这里，还用在内核编译的其它许多地方。
</p>
</div>
</div>
